driver-tests/bpelse/xsddatatypes/XSDDataTypesBpel/src/MsgTypeToXSDType/xsddatatype3.wsdl

<definitions targetNamespace="http://stc.com/xsddatatype3" 
        name="xsddatatype3" 
        xmlns:tns="http://stc.com/xsddatatype3" 
        xmlns:ns1="urn:SampleXSD"             
        xmlns:slnk1="http://docs.oasis-open.org/wsbpel/2.0/plnktype" 
        xmlns:tns0="http://stc.com/xsddatatype3" 
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
        xmlns="http://schemas.xmlsoap.org/wsdl/" 
        xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
        xmlns:slnk="http://schemas.xmlsoap.org/ws/2002/07/service-link/">
        <import location="SampleXSD.xsd" namespace="urn:SampleXSD"/>        
	<message name="xsddatatype3">
		<part name="part" element="ns1:Item"/>
	</message>
	<portType name="xsddatatype3">
		<operation name="xsddatatype3">
			<input message="tns:xsddatatype3"/>
			<output message="tns:xsddatatype3"/>
		</operation>
	</portType>
	<binding name="Binding" type="tns:xsddatatype3">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="xsddatatype3">
			<soap:operation soapAction="xsddatatype3"/>
			<input>
				<soap:body use="literal"/>
			</input>
			<output>
				<soap:body use="literal"/>
			</output>
		</operation>
	</binding>
	<service name="xsddatatype3Service">
		<port name="port" binding="tns:Binding">
			<soap:address location="http://localhost:${HttpDefaultPort}/xsddatatype3"/>
		</port>
	</service>
	<plnk:partnerLinkType name="SLT" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
		<plnk:role name="server" portType="tns:xsddatatype3"/>
	</plnk:partnerLinkType>
</definitions>
