driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/results/MsgTypeToXSDType12/Actual_20130311131749_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <Item xmlns="urn:SampleXSD" xmlns:msgns="http://stc.com/xsddatatype12">
      <value>MsgTypeToXSDType12This is a test off XSDElement to msg type part element</value>
    </Item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>