driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/MsgTypeToXSDType12/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:SampleXSD">
  <soapenv:Body>
    <urn:Item>
      <urn:value>This is a test off XSDElement to msg type part element</urn:value>
    </urn:Item>
  </soapenv:Body>
</soapenv:Envelope>